<?php
/*****************************************************************************
 * SV-Cart js loader
 * ===========================================================================
 * 版权所有  上海实玮网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.seevia.cn
 * ---------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用；
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ===========================================================================
 * $开发: 上海实玮$
 * $Id: index.php 900 2009-03-16 12:10:20Z huangbo $
*****************************************************************************/
$file = $_GET['file'];
$pos = strpos($file, '..');
if ($pos === false) {
	if (is_file('../../vendors/javascript/'.$file) && (preg_match('/(\/.+)\\.js/', $file)))
	{
		readfile('../../vendors/javascript/'.$file);
	}
} else {
	header('HTTP/1.1 404 Not Found');
}
?>