<?php
/*****************************************************************************
 * SV-Cart 广告位置
 * ===========================================================================
 * 版权所有  上海实玮网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.seevia.cn
 * ---------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用；
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ===========================================================================
 * $开发: 上海实玮$
 * $Id: advertisement_position.php 2699 2009-07-08 11:07:31Z huangbo $
*****************************************************************************/
class AdvertisementPosition extends AppModel
{
	var $name = 'AdvertisementPosition';
	var $hasMany = array('Advertisement'=>
						array('className'  => 'Advertisement',
							  'conditions' => '',
							  'order'      => '',
							  'dependent'  => true,
							  'foreignKey' => 'advertisement_position_id'							
						)
					);
}
?>