<?php
/*****************************************************************************
 * SV-Cart 评论
 * ===========================================================================
 * 版权所有  上海实玮网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.seevia.cn
 * ---------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用；
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ===========================================================================
 * $开发: 上海实玮$
 * $Id: comment.php 2876 2009-07-15 06:07:19Z zhengli $
*****************************************************************************/
class Comment extends AppModel
{
	var $name = 'Comment';

	/*
评论列表
*/    
    function get_list($type,$id=''){
		$Lists = array();
		$conditions="status ='1'";
		$conditions.= " AND type = '".$type."'";
		if($id != ''){
		$conditions.= " AND type_id = '".$id."'";
		}
		
		$Lists=$this->findAll($conditions,'','modified asc');
		return $Lists;
	}
	

}
?>