<?php
/*****************************************************************************
 * SV-Cart 在线调查
 * ===========================================================================
 * 版权所有  上海实玮网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.seevia.cn
 * ---------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用；
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ===========================================================================
 * $开发: 上海实玮$
 * $Id: vote.php 2699 2009-07-08 11:07:31Z huangbo $
*****************************************************************************/
class Vote extends AppModel
{
	var $name = 'Vote';
	var $hasOne = array('VoteI18n'=>
						array('className'  => 'VoteI18n',
							  'conditions' => '',
							  'order'      => '',
							  'dependent'  => true,
							  'foreignKey' => 'vote_id'	
						)
					);
	
	
	function set_locale($locale){
    	$conditions = " VoteI18n.locale = '".$locale."'";
    	$this->hasOne['VoteI18n']['conditions'] = $conditions;
        
    }	
	
	
}
?>