<?php
/*****************************************************************************
 * SV-Cart 会员等级
 * ===========================================================================
 * 版权所有  上海实玮网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.seevia.cn
 * ---------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用；
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ===========================================================================
 * $开发: 上海实玮$
 * $Id: memberlevel.php 781 2009-04-18 12:48:57Z huangbo $
*****************************************************************************/
class Memberlevel extends AppModel{
	var $name = 'Memberlevel';


   	function set_locale($locale){
    	$conditions = " MemberlevelI18n.locale = '".$locale."'";
    	$this->hasOne['MemberlevelI18n']['conditions'] = $conditions;
        
    }
   
	}
?>