<?php
/*****************************************************************************
 * SV-Cart 用户
 * ===========================================================================
 * 版权所有  上海实玮网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.seevia.cn
 * ---------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和使用；
 * 不允许对程序代码以任何形式任何目的的再发布。
 * ===========================================================================
 * $开发: 上海实玮$
 * $Id: user.php 725 2009-04-17 08:00:21Z huangbo $
*****************************************************************************/
class User extends AppModel
{
	var $name = 'User';
//更新用户余额
   function update_user_balance($user_id,$amount){
   	      $user_info=$this->find("User.id='".$user_id."'");
	      $user_money=$user_info['User']['balance']+$amount;
	      $update_info=array(
		         'id'=> $user_id,
		         'balance'=> $user_money
		    );
		  $this->User->save(array('User'=>$update_info));
   }
}
?>